
[{"id":"/blog/far-from-finished/","title":"Far From Finished","description":"For us, a launched product rarely means that we are done and it is often future iterations that produce the best results. Nowhere is this more evident than on our own site.","url":"http://www.lacroixdesign.net/blog/far-from-finished/","path":"/blog/far-from-finished/","published":"2015-05-21T10:45:00-05:00","updated":"2015-09-24T22:21:17-05:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eAs it turns out, finding contentment is not one of my stronger traits and this is especially evident when it comes to design. There’s always been the excitement when something Michael and I have made is released to the world. That moment is fleeting once we begin to dissect every minute detail in search of opportunities for improvement.\u003c/p\u003e\n\n\u003cp\u003eCritique is important and I wouldn’t have it any other way. Although, this was quite problematic when I began my career as a print designer and everything that I designed was more permanent. As a web and product designer, I delight in the flexible and iterative qualities of the medium.\u003c/p\u003e\n\n\u003cp\u003eIn the business of client services, you do not always get the opportunity to continually improve upon everything that you ship. Very often, the client is happy, the project ends, you get paid and the thing that you created goes on without you. Sadly, these projects miss out on the beneficial iterations that happen after your have been able to assess how the visitors or users interact with the product.\u003c/p\u003e\n\n\u003cp\u003eLuckily, we have had the pleasure to work with a number of clients who allow us to return to previous projects and tackle new challenges. I’m consistently assured that these experiences will continue to improve if we never treat them as finished. Nowhere is this more evident than in our personal projects. For example, our own website is never finished and we are constantly trying to improve the our visitors\u0026#39; experience.\u003c/p\u003e\n\n\u003cp\u003eNearly a year ago, I wrote a \u003ca target=\"_blank\" href=\"http://www.lacroixdesign.net/blog/doing-more-with-less/\"\u003epost for the launch of our new website\u003c/a\u003e about how a simpler solution provides us with the freedom to iterate. Our current website utilizes \u003ca target=\"_blank\" href=\"https://middlemanapp.com/\"\u003eMiddleman\u003c/a\u003e to generate a static site upon deployment and this provides a fantastic venue for exploring and implementing new solutions. Earlier this year, we made some improvements to our website. In this post, I’d like to share the decision making behind these changes and the results that we’ve received.\u003c/p\u003e\n\n\u003ch3\u003eThe Homepage Welcome Section\u003c/h3\u003e\n\n\u003cp\u003eFirst of all, no other place on the site has received more copy revisions than the first section of our homepage. When you tackle a wide variety of design problems with a range of  solutions and tools, describing your business in one sentence is far from easy.\u003c/p\u003e\n\n\u003cp\u003eFor the first time in a long time, I feel pretty good about what we have on there now. We love to design solutions that establish a connection and allow our clients to engage the audience in a very human way. We decided this copy needed more emphasis, so we adjusted the typography accordingly.\u003c/p\u003e\n\n\u003cfigure class=\"image-stretch-wrap\"\u003e\u003cimg alt=\"The image background to the welcome section of our site was replaced with video, and typographic updates were made as well.\" class=\"image-fullwidth\" width=\"800\" height=\"200\" src=\"http://www.lacroixdesign.net/images/blog/far-from-finished/hero-comparison-89373e60.gif\" /\u003e\u003c/figure\u003e\n\n\u003cp\u003eOur previous background for this section was my desk. I believe that we have a nice workspace and I do tend to keep a tidy desk. However, this was far from being a compelling image for the homepage. We explored a number of solutions for this that included illustrations, solid colors, SVG animation and we eventually decided to use video. We love the personal proximity with which people use mobile devices and found that this created a visual connection to what we value. We also explored various methods of tinting the video to match our pink brand color, but we will cover that in a future post.\u003c/p\u003e\n\n\u003ch3\u003eFeatured Work \u0026amp; Services Section\u003c/h3\u003e\n\n\u003cp\u003eAnother area of our site we were never content with was the featured work section of the homepage. For a while, Michael and I were pretty set on trying to contain these in an interesting shape. After exhausting nearly every option we could think of, we eventually determined it was not the best solution and opted to go with a layout that is more consistent with the case studies on our site. In the end, this provides visitors with a more cohesive experience.\u003c/p\u003e\n\n\u003cfigure class=\"image-stretch-wrap\"\u003e\u003cimg alt=\"Featured Work and Services Section Comparison\" class=\"image-fullwidth\" width=\"800\" height=\"395\" src=\"http://www.lacroixdesign.net/images/blog/far-from-finished/featured-comparison-770a724b.jpg\" /\u003e\u003cfigcaption\u003eOur previous Featured Work and Services sections \u003cem\u003e(left)\u003c/em\u003e compared to the updated design \u003cem\u003e(right)\u003c/em\u003e.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\u003cp\u003ePreviously, we also used an angled container for our services section. On a micro level, we enjoyed this concept, but it did not quite fit with everything else on our website. We determined that our previous image of my workspace might be appropriate in this space. It connects to the collection of tools and devices that we use solve our clients problems. We also made some typography changes to the headers in both of these sections.\u003c/p\u003e\n\n\u003ch3\u003eImproving Visitor Engagement on Blogs \u0026amp; Case Studies\u003c/h3\u003e\n\n\u003cp\u003eBlog posts drive a lot of traffic to our site and this has made writing them a much more enjoyable process. Plus, the increased traffic makes examining the analytics more interesting. We found that many visitors were spending time on the site to read the entire post, but were bouncing off of the page once they finished.\u003c/p\u003e\n\n\u003cfigure class=\"image-stretch-wrap\"\u003e\u003cimg alt=\"Blog Recomendations\" class=\"image-fullwidth\" width=\"800\" height=\"698\" src=\"http://www.lacroixdesign.net/images/blog/far-from-finished/blog-recommendations-a51353b1.jpg\" /\u003e\u003cfigcaption\u003eBlog posts and individual case studies now featured recommendations to facilitate exploration.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\u003cp\u003eThus, we decided to implement a solution that encourages visitors to explore more content. Each post now concludes with a call to action followed by previews for three other posts. We also decided to add a similar experience to the individual case studies pages. The result? We are now seeing visitors land on individual blog or case study and diving deeper into the site.\u003c/p\u003e\n\n\u003ch3\u003eKeeping the Conversation Going\u003c/h3\u003e\n\n\u003cp\u003eSince our website is deployed as a static build, commenting functionality is not a feature of our blog, nor do we really desire to manage comments. However, we do want to keep the conversation going, and Michael and I want to be available for any questions or responses. For this reason, we built a Twitter intent option into our post structure.\u003c/p\u003e\n\n\u003cfigure class=\"image-stretch-wrap\"\u003e\u003cimg alt=\"Blog Post Conversation Actions\" class=\"image-fullwidth\" width=\"1520\" height=\"288\" src=\"http://www.lacroixdesign.net/images/blog/far-from-finished/conversation-actions-bfa533d5.png\" /\u003e\u003cfigcaption\u003eReaders of our blog posts can now engage in the conversation on Twitter or Designer News.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\u003cp\u003eWe have also found that some of our blog posts garner a lot of readers from \u003ca target=\"_blank\" href=\"https://www.designernews.co/\"\u003eDesigner News\u003c/a\u003e. As a result, we decided to add a posting option so that our readers can continue the conversation through comments on Designer News.\u003c/p\u003e\n\n\u003ch3\u003eIncreasing Email Newsletter Signup\u003c/h3\u003e\n\n\u003cp\u003eIn August of last year, we added a subtle newsletter call to action to the footer of our site. Although we began to see subscribers trickle in, this was in no way a successful solution. Therefore, we decided to redesign this call to action to give it more visual weight.\u003c/p\u003e\n\n\u003cfigure class=\"image-stretch-wrap\"\u003e\u003cimg alt=\"Previous Call-To-Action\" class=\"image-fullwidth\" width=\"800\" height=\"400\" src=\"http://www.lacroixdesign.net/images/blog/far-from-finished/previous-newsletter-signup-de44013e.jpg\" /\u003e\u003cfigcaption\u003eOur previous newsletter signup call-to-action.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\u003cfigure class=\"image-stretch-wrap\"\u003e\u003cimg alt=\"New Call-To-Action\" class=\"image-fullwidth\" width=\"800\" height=\"400\" src=\"http://www.lacroixdesign.net/images/blog/far-from-finished/new-newsletter-signup-6d55fff8.jpg\" /\u003e\u003cfigcaption\u003eOur new, more prominent newsletter signup call-to-action.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\u003cp\u003eThe more prominent call to action has more than doubled our list, and we are regularly adding new subscribers. This, in turn, leads to a new challenge of keeping up with our monthly delivery. Due to a busy workload, we have been a bit lax over the past several months, but we plan to pick back up soon.\u003c/p\u003e\n\n\u003ch3\u003eWe’re Still Far from Finished\u003c/h3\u003e\n\n\u003cp\u003eMichael and I have an ongoing \u003ca target=\"_blank\" href=\"https://trello.com/jameslacroix/recommend\"\u003eTrello\u003c/a\u003e board where we regularly add new ideas and discuss solutions for improving our website. In doing so, we are also gaining clients who learn to value the process and set aside budgets for continual improvement.\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/far-from-finished/hurdle-3aaaeaa6.jpg"}]
